### Riley Payung
### CDS 302-DL1
### 04/26/2020
### Assignment 7

#### Imports

In [1]:
import sqlite3 as sql
import pandas as pd
import numpy as np

In [2]:
# Start the connection to a local database called onlineStore. 
# (I could easily change this to be somewhere either on my network 
# or on another network if I wanted to, but its out of the scope of 
# this homework assignment)
db = sql.connect('onlinestore.db');

In [3]:
# creating the product table query. Made it look like how it would be in SQL itself:
query = '''
CREATE TABLE IF NOT EXISTS products(
    id int PRIMARY KEY NOT NULL,
    size varchar(10),
    price int,
    vend_name varchar(10));
'''

In [4]:
# Execute the product table creation
result = db.execute(query);
df = pd.read_sql_query('SELECT * FROM products',db);
df

Empty DataFrame
Columns: [id, size, price, vend_name]
Index: []

In [5]:
# Create the Item table query.
query = '''
CREATE TABLE IF NOT EXISTS Item (
    id int NOT NULL,
    quantity int NOT NULL,
    o_id int NOT NULL,
    PRIMARY KEY (id, quantity)
);
'''

In [6]:
# Execute the Item table creation
result = db.execute(query);
df2 = pd.read_sql_query('SELECT * FROM Item',db);
df2

Empty DataFrame
Columns: [id, quantity, o_id]
Index: []

In [7]:
# Create the Orders table query
query = '''
CREATE TABLE IF NOT EXISTS Orders (
    o_id int PRIMARY KEY NOT NULL,  
    date varchar(20) NOT NULL,
    emp_id int,
    prep_date varchar(20),
    cust_id int
);
'''

In [8]:
# Execute the Orders table creation
result = db.execute(query);
df3 = pd.read_sql_query('SELECT * FROM Orders',db);
df3

Empty DataFrame
Columns: [o_id, date, emp_id, prep_date, cust_id]
Index: []

In [9]:
# Create the Employees table query
query = '''
CREATE TABLE IF NOT EXISTS Employee (
    emp_id int PRIMARY KEY NOT NULL,  
    firstname varchar(20) NOT NULL,
    middlename varchar(20),
    lastname varchar(20) NOT NULL,
    salary int,
    supervisor_id int
);
'''

In [10]:
# Execute the Orders table creation
result = db.execute(query);
df4 = pd.read_sql_query('SELECT * FROM Employee',db);
df4

Empty DataFrame
Columns: [emp_id, firstname, middlename, lastname, salary, supervisor_id]
Index: []

In [11]:
# Set the queries for entry into Employee table

query = '''
    INSERT INTO Employee VALUES ('0001','Riley','Christopher','Payung','90000','');
'''
query2 = '''INSERT INTO Employee VALUES ('0002','Jack','Greg','Chapman','25000','0001');
'''

In [12]:
# execute query 1
result = db.execute(query);
print(result.fetchall());
# execute query 2
result = db.execute(query2);
print(result.fetchall());

[]
[]

In [13]:
# Print out the current state of the Employee table
df5 = pd.read_sql_query('SELECT * FROM Employee',db);
df5

   emp_id firstname   middlename lastname  salary supervisor_id
0       1     Riley  Christopher   Payung   90000
1       2      Jack         Greg  Chapman   25000             1

In [14]:
# Set the queries for entry into Products table
query = '''
    INSERT INTO Products VALUES ('0001','Medium','15','G Solutions');
'''
query2 = '''
    INSERT INTO Products VALUES ('0002','Small','13','Hammerhead');
'''

In [15]:
# execute query 1
result = db.execute(query);
print(result.fetchall());
# execute query 2
result = db.execute(query2);
print(result.fetchall());

[]
[]

In [16]:
# Print out the current state of the Products table
df6 = pd.read_sql_query('SELECT * FROM Products',db);
df6

   id    size  price    vend_name
0   1  Medium     15  G Solutions
1   2   Small     13   Hammerhead

In [17]:
# Set the queries for entry into Item table
query = '''
    INSERT INTO Item VALUES ('0001','5','0001');
'''
query2 = '''
    INSERT INTO Item VALUES ('0002','10','0001');
'''

In [18]:
# execute query 1
result = db.execute(query);
print(result.fetchall());
# execute query 2
result = db.execute(query2);
print(result.fetchall());

[]
[]

In [19]:
# Print out the current state of the Item table
df7 = pd.read_sql_query('SELECT * FROM Item',db);
df7

   id  quantity  o_id
0   1         5     1
1   2        10     1

In [20]:
# Set the queries for entry into Orders table
query = '''
    INSERT INTO Orders VALUES ('0001','Jan-20-2020','0002','Jan-21-2020','0001');
'''
query2 = '''
    INSERT INTO Orders VALUES ('0002','Jan-25-2020','0001','Jan-28-2020','0002');
'''

In [21]:
# execute query 1
result = db.execute(query);
print(result.fetchall());
# execute query 2
result = db.execute(query2);
print(result.fetchall());

[]
[]

In [22]:
# Print out the current state of the Orders table
df8 = pd.read_sql_query('SELECT * FROM Orders',db);
df8

   o_id         date  emp_id    prep_date  cust_id
0     1  Jan-20-2020       2  Jan-21-2020        1
1     2  Jan-25-2020       1  Jan-28-2020        2

In [23]:
# Commit all changes made to the database.
db.commit();

In [24]:
# Select the product tuples from products using the fetchall function.
result = db.execute('SELECT * FROM products');
print(result.fetchall());

[(1, 'Medium', 15, 'G Solutions'), (2, 'Small', 13, 'Hammerhead')]

In [25]:
# Create the data frame of employes
df_employee = pd.read_sql_query('SELECT * FROM Employee',db);
df_employee

   emp_id firstname   middlename lastname  salary supervisor_id
0       1     Riley  Christopher   Payung   90000
1       2      Jack         Greg  Chapman   25000             1

In [26]:
# Create the csv file of the data frame Employees
df_csv = df_employee.to_csv('df_csv.csv');
print(df_csv);

None

In [27]:
# Read the employees csv file (df_csv) to create a data frame.
df_employee2 = pd.read_csv('df_csv.csv');
df_employee2

   Unnamed: 0  emp_id firstname   middlename lastname  salary  supervisor_id
0           0       1     Riley  Christopher   Payung   90000            NaN
1           1       2      Jack         Greg  Chapman   25000            1.0

In [28]:
# Closing the local connection after everything has been finished.
db.close()